---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.MemberForcesService
source: html/53b97045-eed7-550b-9ed4-5797d1a0f9ca.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.MemberForcesService Property

The external service supporting view and modification of the member forces in analytical elements.
 The service is still under development and cannot be used. It means that no server can be external registered from it yet.

## Syntax (C#)
```csharp
public static ExternalServiceId MemberForcesService { get; }
```